Управление_закупками/src/Tasks/ЗадачиИсполнителейОМТС/ЗадачиИсполнителейОМТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиИсполнителейОМТС</name>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Замечания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоВРаботу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

Управление_закупками/src/InformationRegisters/РаспределениеПоИсполнителямОМТС/РаспределениеПоИсполнителямОМТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПоИсполнителямОМТС</name>
  <resources>
    <name>СотрудникОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_закупками/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>EnumRef.ВидПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДокументация</name>
    <type>
      <types>CatalogRef.РабочаяДокументация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСогласованПТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОтправленВОМТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаказаВОМТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправилВОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДляКорректировки</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/Tasks/ЗадачиИсполнителейОМТС/Forms/ФормаЗадачиПодтвердитьРаспределениеЗаказаПоИсполнителю/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	АвтоЗаголовок = Ложь;
	Заголовок = Объект.Наименование; 
	
	Флажок = Истина;
	
	Если Объект.Выполнена Тогда
		ЭтаФорма.ТолькоПросмотр = Истина; 
		Элементы.Флажок.ТолькоПросмотр = Истина;
		Заголовок = Заголовок + " (Только просмотр)";
		ИнструкцияВыполненияЗадачи = "Задача выполнена";
	Иначе
		ИнструкцияВыполненияЗадачи = "Для выполнения задачи необходимо:
		|1. Просмотреть список распределения.
		|2. Если в списке имеются позиции не по Вашей номенклатуре, то снимите ометку в колонке ""Принято в работу"".
		|3. Не взятые в работу позиции заново распределит Руководитель ОМТС";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВнутреннийЗаказ(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Объект.ВнутреннийЗаказ); 
	ОткрытьФорму("Документ.ВнутреннийЗаказ.Форма.ФормаДокумента",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначение(Команда)
	
	ПринятоВРаботу  = Флажок;
	
	Для Каждого ВыбраннаяСтрока Из Элементы.СписокНоменклатуры.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.СписокНоменклатуры.ДанныеСтроки(ВыбраннаяСтрока);
		ДанныеСтроки.ПринятоВработу = ПринятоВРаботу;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботуОтмеченные(Команда)
	
	Если Модифицированность Тогда  
		Если Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВзятьВРаботуОтмеченныеНаСервере();

	Оповестить("Запись_ЗадачиЗадачиИсполнителейОМТС");
	ЭтаФорма.Модифицированность = Ложь; 
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ВыполнитьТекущуюЗадачуНаСервере()
	
	ТекущаяЗадача = РеквизитФормыВЗначение("Объект");
	ТекущаяЗадача.ВыполнитьЗадачу();
	
КонецФункции

&НаСервере
Функция УдалитьНеВзятыеВРаботуПозицииРегистрСведенийРаспределениеПоИсполнителямОМТС()
	
	СписокНоменклатуры = Объект.СписокНоменклатуры.Выгрузить(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СписокНоменклатуры.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	|	СписокНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения, 
	|	СписокНоменклатуры.Количество КАК Количество
	|ПОМЕСТИТЬ ВТСписокНоменклатуры
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|ГДЕ
	|	НЕ СписокНоменклатуры.ПринятоВработу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокНоменклатуры.Номенклатура КАК Номенклатура, 
	|	ВТСписокНоменклатуры.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	|	ВТСписокНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСписокНоменклатуры.Количество КАК Количество,
	|	&ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ИЗ
	|	ВТСписокНоменклатуры КАК ВТСписокНоменклатуры";  
	
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);   
	Запрос.УстановитьПараметр("ВнутреннийЗаказ", Объект.ВнутреннийЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СписокОтказов = РезультатЗапроса.Выгрузить();  
	
		Блокировка = Новый БлокировкаДанных;
	
		ЭлементБлокировкиДанных = Блокировка.Добавить("РегистрСведений.РаспределениеПоИсполнителямОМТС");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировкиДанных.ИсточникДанных = СписокОтказов;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЕдиницаИзмерения", "ЕдиницаИзмерения"); 
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ДополнительныеХарактеристикиНоменклатуры", "ДополнительныеХарактеристикиНоменклатуры");
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ВнутреннийЗаказ", "ВнутреннийЗаказ");
		Блокировка.Заблокировать();
		
		Для Каждого ЗаписьКУдалению Из СписокОтказов  Цикл
			
			Запись =  РегистрыСведений.РаспределениеПоИсполнителямОМТС.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,ЗаписьКУдалению);
			Запись.Удалить();
			
		КонецЦикла; 
		
		Возврат СписокОтказов; 
		
	Иначе
		
		Возврат Неопределено; 
		
	КонецЕсли;
	
Конецфункции

&НаСервере
Процедура ВзятьВРаботуОтмеченныеНаСервере()
	
	НачатьТранзакцию();  
	
	Попытка
		
		СписокОтказов = УдалитьНеВзятыеВРаботуПозицииРегистрСведенийРаспределениеПоИсполнителямОМТС();
		Если СписокОтказов <> Неопределено Тогда 
			
			БизнесПроцессыИЗадачиСервер.СоздатьЗадачуРаспределениеЗаявкиПоИсполителям(Объект.ВнутреннийЗаказ,СписокОтказов);
			
		КонецЕсли;
		                                                    
		ВыполнитьТекущуюЗадачуНаСервере();

		ЗафиксироватьТранзакцию(); 
		
	Исключение 
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заметки'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
		ВызватьИсключение;
		
	КонецПопытки;
	
	
	
КонецПроцедуры
